package main

import "fmt"

func main() {
	x, y := 5, 8
	// ビットOR
	// 0101 = 5
	// 1000 = 8
	// --------
	// 1101 = 13
	fmt.Println("bit OR", x|y)

	x, y = 5, 13
	// ビットAND
	// 0101 = 5
	// 1101 = 13
	// --------
	// 0101 = 5
	fmt.Println("bit AND:", x&y)

	// ビットAND
	// 0101 = 5
	// 1101 = 13
	// --------
	// 1000 = 8
	fmt.Println("bit XOR:", x^y)

	// 左シフト
	// 000101 = 5
	// ----------
	// 010100 = 20
	// x<<n xを2のn乗倍する
	fmt.Println("左2ビットシフト", x<<2)

	// 右シフト
	// 000101 = 5
	// ----------
	// 000010 = 2
	// x>>n xを1/2のn乗倍する
	fmt.Println("右1ビットシフト", x>>1)
}
